pebble/qemu/hw/stm32f2xx_defines.h
#define GPIO_PUPDR_PUPDR12                   ((uint32_t)0x03000000)
#define GPIO_PUPDR_PUPDR12_0                 ((uint32_t)0x01000000)
#define GPIO_PUPDR_PUPDR12_1                 ((uint32_t)0x02000000)

#define GPIO_PUPDR_PUPDR13                   ((uint32_t)0x0C000000)
#define GPIO_PUPDR_PUPDR13_0                 ((uint32_t)0x04000000)
#define GPIO_PUPDR_PUPDR13_1                 ((uint32_t)0x08000000)

#define GPIO_PUPDR_PUPDR14                   ((uint32_t)0x30000000)
#define GPIO_PUPDR_PUPDR14_0                 ((uint32_t)0x10000000)
#define GPIO_PUPDR_PUPDR14_1                 ((uint32_t)0x20000000)

#define GPIO_PUPDR_PUPDR15                   ((uint32_t)0xC0000000)
#define GPIO_PUPDR_PUPDR15_0                 ((uint32_t)0x40000000)
#define GPIO_PUPDR_PUPDR15_1                 ((uint32_t)0x80000000)

/******************  Bits definition for GPIO_IDR register  *******************/
#define GPIO_OTYPER_IDR_0                    ((uint32_t)0x00000001)
#define GPIO_OTYPER_IDR_1                    ((uint32_t)0x00000002)
#define GPIO_OTYPER_IDR_2                    ((uint32_t)0x00000004)
#define GPIO_OTYPER_IDR_3                    ((uint32_t)0x00000008)
#define GPIO_OTYPER_IDR_4                    ((uint32_t)0x00000010)
#define GPIO_OTYPER_IDR_5                    ((uint32_t)0x00000020)
#define GPIO_OTYPER_IDR_6                    ((uint32_t)0x00000040)
#define GPIO_OTYPER_IDR_7                    ((uint32_t)0x00000080)
#define GPIO_OTYPER_IDR_8                    ((uint32_t)0x00000100)
#define GPIO_OTYPER_IDR_9                    ((uint32_t)0x00000200)
#define GPIO_OTYPER_IDR_10                   ((uint32_t)0x00000400)
#define GPIO_OTYPER_IDR_11                   ((uint32_t)0x00000800)
#define GPIO_OTYPER_IDR_12                   ((uint32_t)0x00001000)
#define GPIO_OTYPER_IDR_13                   ((uint32_t)0x00002000)
#define GPIO_OTYPER_IDR_14                   ((uint32_t)0x00004000)
#define GPIO_OTYPER_IDR_15                   ((uint32_t)0x00008000)

/******************  Bits definition for GPIO_ODR register  *******************/
#define GPIO_OTYPER_ODR_0                    ((uint32_t)0x00000001)
#define GPIO_OTYPER_ODR_1                    ((uint32_t)0x00000002)
#define GPIO_OTYPER_ODR_2                    ((uint32_t)0x00000004)
#define GPIO_OTYPER_ODR_3                    ((uint32_t)0x00000008)
#define GPIO_OTYPER_ODR_4                    ((uint32_t)0x00000010)
#define GPIO_OTYPER_ODR_5                    ((uint32_t)0x00000020)
#define GPIO_OTYPER_ODR_6                    ((uint32_t)0x00000040)
#define GPIO_OTYPER_ODR_7                    ((uint32_t)0x00000080)
#define GPIO_OTYPER_ODR_8                    ((uint32_t)0x00000100)
#define GPIO_OTYPER_ODR_9                    ((uint32_t)0x00000200)
#define GPIO_OTYPER_ODR_10                   ((uint32_t)0x00000400)
#define GPIO_OTYPER_ODR_11                   ((uint32_t)0x00000800)
#define GPIO_OTYPER_ODR_12                   ((uint32_t)0x00001000)
#define GPIO_OTYPER_ODR_13                   ((uint32_t)0x00002000)
#define GPIO_OTYPER_ODR_14                   ((uint32_t)0x00004000)
#define GPIO_OTYPER_ODR_15                   ((uint32_t)0x00008000)

/******************  Bits definition for GPIO_BSRR register  ******************/
#define GPIO_BSRR_BS_0                       ((uint32_t)0x00000001)
#define GPIO_BSRR_BS_1                       ((uint32_t)0x00000002)
#define GPIO_BSRR_BS_2                       ((uint32_t)0x00000004)
#define GPIO_BSRR_BS_3                       ((uint32_t)0x00000008)
#define GPIO_BSRR_BS_4                       ((uint32_t)0x00000010)
#define GPIO_BSRR_BS_5                       ((uint32_t)0x00000020)
#define GPIO_BSRR_BS_6                       ((uint32_t)0x00000040)
#define GPIO_BSRR_BS_7                       ((uint32_t)0x00000080)
#define GPIO_BSRR_BS_8                       ((uint32_t)0x00000100)
#define GPIO_BSRR_BS_9                       ((uint32_t)0x00000200)
#define GPIO_BSRR_BS_10                      ((uint32_t)0x00000400)
#define GPIO_BSRR_BS_11                      ((uint32_t)0x00000800)
#define GPIO_BSRR_BS_12                      ((uint32_t)0x00001000)
#define GPIO_BSRR_BS_13                      ((uint32_t)0x00002000)
#define GPIO_BSRR_BS_14                      ((uint32_t)0x00004000)
#define GPIO_BSRR_BS_15                      ((uint32_t)0x00008000)
#define GPIO_BSRR_BR_0                       ((uint32_t)0x00010000)
#define GPIO_BSRR_BR_1                       ((uint32_t)0x00020000)
#define GPIO_BSRR_BR_2                       ((uint32_t)0x00040000)
#define GPIO_BSRR_BR_3                       ((uint32_t)0x00080000)
#define GPIO_BSRR_BR_4                       ((uint32_t)0x00100000)
#define GPIO_BSRR_BR_5                       ((uint32_t)0x00200000)
#define GPIO_BSRR_BR_6                       ((uint32_t)0x00400000)
#define GPIO_BSRR_BR_7                       ((uint32_t)0x00800000)
#define GPIO_BSRR_BR_8                       ((uint32_t)0x01000000)
#define GPIO_BSRR_BR_9                       ((uint32_t)0x02000000)
#define GPIO_BSRR_BR_10                      ((uint32_t)0x04000000)
#define GPIO_BSRR_BR_11                      ((uint32_t)0x08000000)
#define GPIO_BSRR_BR_12                      ((uint32_t)0x10000000)
#define GPIO_BSRR_BR_13                      ((uint32_t)0x20000000)
#define GPIO_BSRR_BR_14                      ((uint32_t)0x40000000)
#define GPIO_BSRR_BR_15                      ((uint32_t)0x80000000)

/******************************************************************************/
/*                                                                            */
/*                                    HASH                                    */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for HASH_CR register  ********************/
#define HASH_CR_INIT                         ((uint32_t)0x00000004)
#define HASH_CR_DMAE                         ((uint32_t)0x00000008)
#define HASH_CR_DATATYPE                     ((uint32_t)0x00000030)
#define HASH_CR_DATATYPE_0                   ((uint32_t)0x00000010)
#define HASH_CR_DATATYPE_1                   ((uint32_t)0x00000020)
#define HASH_CR_MODE                         ((uint32_t)0x00000040)
#define HASH_CR_ALGO                         ((uint32_t)0x00000080)
#define HASH_CR_NBW                          ((uint32_t)0x00000F00)
#define HASH_CR_NBW_0                        ((uint32_t)0x00000100)
#define HASH_CR_NBW_1                        ((uint32_t)0x00000200)
#define HASH_CR_NBW_2                        ((uint32_t)0x00000400)
#define HASH_CR_NBW_3                        ((uint32_t)0x00000800)
#define HASH_CR_DINNE                        ((uint32_t)0x00001000)
#define HASH_CR_LKEY                         ((uint32_t)0x00010000)

